app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["name", "phily"], ["updated_at", "2014-05-28 22:13:08.546349"]]