app/views/users/profile.html.erb

SELECT "answers".* FROM "answers"  WHERE "answers"."user_id" = $1  [["user_id", 2]]
---
  </tr>
  <% @user.answers.each do |answer| %>