app/views/shared/_question.html.erb

SELECT  1 AS one FROM "answers"  WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 1]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  [["question_id", 1]]
---

  <% if !question.answers.empty? %>