app/views/answers/show.html.erb

SELECT COUNT(*) FROM "votes"  WHERE "votes"."answer_id" = 5 AND (vote_value > 0)
---
<script>
  $(document).ready(function(){
    start = JSON.parse($('.show_delta').text())[0][0];
    delta = JSON.parse($('.show_delta').text());
    end   = JSON.parse($('.show_delta').text())[Object.keys(delta).length-1][0];

    $('.do_vote').click(function(e){
      e.preventDefault();
      var data = $(this).parent().serialize();
      console.log("vote clicked: " + data);
      $.post('/vote.json', data)
      .success(function(response){
        console.log("AJAX success" + response.text);
        $(response.id).html(response.text);
      });

    });

    $('.show_original').html(start)
    $('.show_final').html(end)

    player = new Player({