app/controllers/answers_controller.rb

  def new
    if current_user && params[:question]
      @question = Question.find(params[:question])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 5]]