app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    if params[:start_language] && params[:end_language]
    	@categories = Category.all