app/controllers/languages_controller.rb

  def index
    @splash = true
    @languages = Language.all
---
SELECT "languages".* FROM "languages"