app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def find_question_id
    @question = Question.find(params[:question_id]||params[:id])