app/controllers/questions_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "languages".* FROM "languages"  WHERE "languages"."name" = 'Ruby' LIMIT 1
SELECT "questions".* FROM "questions"  WHERE "questions"."category_id" = 1 AND "questions"."start_language" = 'Ruby' AND "questions"."end_language" = 'JavaScript'
---
  def index
    if params[:start_language] && params[:end_language] && params[:category]
      @category = Category.find(params[:category])
    	@category_id = Category.find(params[:category]).id
    	@start_language = Language.find_by_name(params[:start_language]).name
    	@end_language = Language.find_by_name(params[:end_language]).name
    	@questions = Question.where(category_id: @category_id, start_language: @start_language, end_language: @end_language)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "languages".* FROM "languages"  WHERE "languages"."name" = 'Ruby' LIMIT 1
---
  def show
  	@question = Question.find(params[:id])
    @answers = @question.answers
  	@start_language = Language.find_by_name(@question.start_language)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  [["question_id", 2]]
---
  def get_answer
    @question = Question.find(params[:question_id])
    @answer  = @question.answers.first.delta