app/controllers/sessions_controller.rb

  def attempt_login

    if params[:email_username].present? && params[:password].present?
      #user can login using either email or username
      if params[:email_username].include?("@")
        found_user = User.where(email: params[:email_username]).first
      else
        found_user = User.where(username: params[:email_username]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'jo'  ORDER BY "users"."id" ASC LIMIT 1