app/views/admin/users/show.html.erb

<table class='table' style='color:white;'>
  <% @user.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers"  WHERE "answers"."user_id" = $1  [["user_id", 2]]